# Practice_Part_07: Data Grouping and Aggregation Solution

In [1]:
import pandas as pd
import numpy as np

In [2]:
titanic = pd.read_csv('data/titanic/original_titanic.csv')
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

#### Exercise_01 Solution
For the titanic data present in 'data/titanic':
1. Group the titanic data based on 'sex' column and find the mean age of the male and female passengers
2. Use the indexing method to find the mean age istead of using the groupby method
3. Group the data based on 'sex' column, and find the number of male and female passengers survived
4. Count the number of passengers survived and not-survived based on the gender, and cross check the result
5. Group the data based on the column 'sex' and iterate over the key and data

1. Group the titanic data based on 'sex' column and find the mean age of the male and female passengers

In [3]:
grouped = titanic['age'].groupby(by=titanic['sex'])
grouped

In [4]:
grouped.mean()

sex
female    28.687088
male      30.585228
Name: age, dtype: float64

2. Use the indexing method to find the mean age istead of using the groupby method

In [5]:
titanic['sex'][titanic['sex']=='male']

1       male
3       male
5       male
7       male
9       male
        ...
1302    male
1303    male
1306    male
1307    male
1308    male
Name: sex, Length: 843, dtype: object

In [6]:
titanic['age'][titanic['sex']=='male'].mean()

30.58522796352584

In [7]:
titanic['age'][titanic['sex']=='female'].mean()

28.68708762886598

3. Group the data based on 'sex' column, and find the number of male and female passengers survived

In [8]:
g_sex_age = titanic['survived'].groupby(by=[titanic['sex']])
g_sex_age

In [9]:
g_sex_age.sum()

sex
female    339
male      161
Name: survived, dtype: int64

4. Count the number of passengers survived and not-survived based on the gender, and cross check the result

In [10]:
titanic.groupby(by=['sex', 'survived']).size()

sex     survived
female  0           127
        1           339
male    0           682
        1           161
dtype: int64

In [11]:
print('Total Female Passengers:', 127+339); print('Total Male Passengers:', 682+161)
print('Total Passengers:', 127+339+682+161)

Total Female Passengers: 466
Total Male Passengers: 843
Total Passengers: 1309

5. Group the data based on the column 'sex' and iterate over the key and data

In [12]:
grouped = titanic.groupby(by='sex')

In [13]:
for key, data in grouped:
    print(key)
    print(data)

female
      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
2          1         0                     Allison, Miss. Helen Loraine
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
6          1         1                Andrews, Miss. Kornelia Theodosia
8          1         1    Appleton, Mrs. Edward Dale (Charlotte Lamson)
...      ...       ...                                              ...
1286       3         1  Whabee, Mrs. George Joseph (Shawneene Abi-Saab)
1290       3         1                 Wilkes, Mrs. James (Ellen Needs)
1300       3         1          Yasbeck, Mrs. Antoni (Selini Alexander)
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine

         sex   age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0      0      0   24160  211.3375       B5        S    2
2     female   2.0      1      2  113781  151.5500  C22 C26        S  NaN
4     female  25.0      1      2  113781  151.5500  C22 C26        S  NaN
6     female  63.0      1      0   13502   77.9583       D7        S   10
8     female  53.0      2      0   11769   51.4792     C101        S    D
...      ...   ...    ...    ...     ...       ...      ...      ...  ...
1286  female  38.0      0      0    2688    7.2292      NaN        C    C
1290  female  47.0      1      0  363272    7.0000      NaN        S  NaN
1300  female  15.0      1      0    2659   14.4542      NaN        C  NaN
1304  female  14.5      1      0    2665   14.4542      NaN        C  NaN
1305  female   NaN      1      0    2665   14.4542      NaN        C  NaN

       body                        home.dest
0       NaN                     St Louis, MO
2       NaN  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
6       NaN                       Hudson, NY
8       NaN              Bayside, Queens, NY
...     ...                              ...
1286    NaN                              NaN
1290    NaN                              NaN
1300    NaN                              NaN
1304  328.0                              NaN
1305    NaN                              NaN

[466 rows x 14 columns]
male
      pclass  survived                                  name   sex    age  \
1          1         1        Allison, Master. Hudson Trevor  male   0.92
3          1         0  Allison, Mr. Hudson Joshua Creighton  male  30.00
5          1         1                   Anderson, Mr. Harry  male  48.00
7          1         0                Andrews, Mr. Thomas Jr  male  39.00
9          1         0               Artagaveytia, Mr. Ramon  male  71.00
...      ...       ...                                   ...   ...    ...
1302       3         0                     Yousif, Mr. Wazli  male    NaN
1303       3         0                 Yousseff, Mr. Gerious  male    NaN
1306       3         0             Zakarian, Mr. Mapriededer  male  26.50
1307       3         0                   Zakarian, Mr. Ortin  male  27.00
1308       3         0                    Zimmerman, Mr. Leo  male  29.00

      sibsp  parch    ticket      fare    cabin embarked boat   body  \
1         1      2    113781  151.5500  C22 C26        S   11    NaN
3         1      2    113781  151.5500  C22 C26        S  NaN  135.0
5         0      0     19952   26.5500      E12        S    3    NaN
7         0      0    112050    0.0000      A36        S  NaN    NaN
9         0      0  PC 17609   49.5042      NaN        C  NaN   22.0
...     ...    ...       ...       ...      ...      ...  ...    ...
1302      0      0      2647    7.2250      NaN        C  NaN    NaN
1303      0      0      2627   14.4583      NaN        C  NaN    NaN
1306      0      0      2656    7.2250      NaN        C  NaN  304.0
1307      0      0      2670    7.2250      NaN        C  NaN    NaN
1308      0      0    315082    7.8750      NaN        S  NaN    NaN

                            home.dest
1     Montreal, PQ / Chesterville, ON
3     Montreal, PQ / Chesterville, ON
5                        New York, NY
7                         Belfast, NI
9                 Montevideo, Uruguay
...                               ...
1302                              NaN
1303                              NaN
1306                              NaN
1307                              NaN
1308                              NaN

[843 rows x 14 columns]

#### Exercise_02 Solution
1. Group the titanic data along the column, and iterate over the key and data 
2. Group the titanic data based on ['pclass', 'survived', 'sex'] and count the number of passengers survived on each type of 'pclass'
3. Use the 'survived' data as the list of values to find the total number of passengers survived using groupby method
4. Group the titanic data based on ['sex', 'name'] and find the total number of people survived
5. Find the most used type of 'embarked' by the passengers
6. Find the maximum age and the maximum pclass type
7. Find the top 'cabins' in the titanic ship using describe method on the column 'cabin'

1. Group the titanic data along the column, and iterate over the key and data

In [14]:
titanic.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [15]:
grouped_column = titanic.groupby(by=titanic.dtypes, axis=1)
for datatype, data in grouped_column:
    print(datatype)
    print(data)

int64
      pclass  survived  sibsp  parch
0          1         1      0      0
1          1         1      1      2
2          1         0      1      2
3          1         0      1      2
4          1         0      1      2
...      ...       ...    ...    ...
1304       3         0      1      0
1305       3         0      1      0
1306       3         0      0      0
1307       3         0      0      0
1308       3         0      0      0

[1309 rows x 4 columns]
float64
        age      fare   body
0     29.00  211.3375    NaN
1      0.92  151.5500    NaN
2      2.00  151.5500    NaN
3     30.00  151.5500  135.0
4     25.00  151.5500    NaN
...     ...       ...    ...
1304  14.50   14.4542  328.0
1305    NaN   14.4542    NaN
1306  26.50    7.2250  304.0
1307  27.00    7.2250    NaN
1308  29.00    7.8750    NaN

[1309 rows x 3 columns]
object
                                                 name     sex  ticket  \
0                       Allen, Miss. Elisabeth Walton  female   24160
1                      Allison, Master. Hudson Trevor    male  113781
2                        Allison, Miss. Helen Loraine  female  113781
3                Allison, Mr. Hudson Joshua Creighton    male  113781
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  113781
...                                               ...     ...     ...
1304                             Zabour, Miss. Hileni  female    2665
1305                            Zabour, Miss. Thamine  female    2665
1306                        Zakarian, Mr. Mapriededer    male    2656
1307                              Zakarian, Mr. Ortin    male    2670
1308                               Zimmerman, Mr. Leo    male  315082

        cabin embarked boat                        home.dest
0          B5        S    2                     St Louis, MO
1     C22 C26        S   11  Montreal, PQ / Chesterville, ON
2     C22 C26        S  NaN  Montreal, PQ / Chesterville, ON
3     C22 C26        S  NaN  Montreal, PQ / Chesterville, ON
4     C22 C26        S  NaN  Montreal, PQ / Chesterville, ON
...       ...      ...  ...                              ...
1304      NaN        C  NaN                              NaN
1305      NaN        C  NaN                              NaN
1306      NaN        C  NaN                              NaN
1307      NaN        C  NaN                              NaN
1308      NaN        S  NaN                              NaN

[1309 rows x 7 columns]

2. Group the titanic data based on ['pclass', 'survived', 'sex'] and count the number of passengers survived on each type of 'pclass'

In [16]:
titanic_2 = titanic[['pclass', 'survived', 'sex']]
titanic_2

      pclass  survived     sex
0          1         1  female
1          1         1    male
2          1         0  female
3          1         0    male
4          1         0  female
...      ...       ...     ...
1304       3         0  female
1305       3         0  female
1306       3         0    male
1307       3         0    male
1308       3         0    male

[1309 rows x 3 columns]

In [17]:
grouped_titanic_2 = titanic_2[['survived', 'sex']].groupby(by=titanic_2['pclass'])

In [18]:
grouped_titanic_2.sum()

        survived
pclass
1            200
2            119
3            181

In [19]:
print('Total Survived:', 200+119+181)

Total Survived: 500

3. Use the 'survived' data as the list of values to find the total number of passengers survived using groupby method

In [20]:
list_survived = titanic['survived'].tolist()
list_survived[:10]

[1, 1, 0, 0, 0, 1, 1, 0, 1, 0]

In [21]:
titanic_indexed = titanic.set_index('name')
titanic_indexed

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
"Allison, Master. Hudson Trevor",1,1,male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Miss. Helen Loraine",1,0,female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
"Zabour, Miss. Hileni",3,0,female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
"Zabour, Miss. Thamine",3,0,female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
"Zakarian, Mr. Mapriededer",3,0,male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
"Zakarian, Mr. Ortin",3,0,male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
"Zimmerman, Mr. Leo",3,0,male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [22]:
titanic_indexed['survived'].groupby([list_survived]).sum()

0      0
1    500
Name: survived, dtype: int64

4. Group the titanic data based on ['sex', 'name'] and find the total number of people survived

In [23]:
titanic_3 = titanic.set_index(['sex', 'name'])
titanic_3

                                                        pclass  survived  \
sex    name
female Allen, Miss. Elisabeth Walton                         1         1
male   Allison, Master. Hudson Trevor                        1         1
female Allison, Miss. Helen Loraine                          1         0
male   Allison, Mr. Hudson Joshua Creighton                  1         0
female Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1         0
...                                                        ...       ...
       Zabour, Miss. Hileni                                  3         0
       Zabour, Miss. Thamine                                 3         0
male   Zakarian, Mr. Mapriededer                             3         0
       Zakarian, Mr. Ortin                                   3         0
       Zimmerman, Mr. Leo                                    3         0

                                                          age  sibsp  parch  \
sex    name
female Allen, Miss. Elisabeth Walton                    29.00      0      0
male   Allison, Master. Hudson Trevor                    0.92      1      2
female Allison, Miss. Helen Loraine                      2.00      1      2
male   Allison, Mr. Hudson Joshua Creighton             30.00      1      2
female Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.00      1      2
...                                                       ...    ...    ...
       Zabour, Miss. Hileni                             14.50      1      0
       Zabour, Miss. Thamine                              NaN      1      0
male   Zakarian, Mr. Mapriededer                        26.50      0      0
       Zakarian, Mr. Ortin                              27.00      0      0
       Zimmerman, Mr. Leo                               29.00      0      0

                                                        ticket      fare  \
sex    name
female Allen, Miss. Elisabeth Walton                     24160  211.3375
male   Allison, Master. Hudson Trevor                   113781  151.5500
female Allison, Miss. Helen Loraine                     113781  151.5500
male   Allison, Mr. Hudson Joshua Creighton             113781  151.5500
female Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  113781  151.5500
...                                                        ...       ...
       Zabour, Miss. Hileni                               2665   14.4542
       Zabour, Miss. Thamine                              2665   14.4542
male   Zakarian, Mr. Mapriededer                          2656    7.2250
       Zakarian, Mr. Ortin                                2670    7.2250
       Zimmerman, Mr. Leo                               315082    7.8750

                                                          cabin embarked boat  \
sex    name
female Allen, Miss. Elisabeth Walton                         B5        S    2
male   Allison, Master. Hudson Trevor                   C22 C26        S   11
female Allison, Miss. Helen Loraine                     C22 C26        S  NaN
male   Allison, Mr. Hudson Joshua Creighton             C22 C26        S  NaN
female Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  C22 C26        S  NaN
...                                                         ...      ...  ...
       Zabour, Miss. Hileni                                 NaN        C  NaN
       Zabour, Miss. Thamine                                NaN        C  NaN
male   Zakarian, Mr. Mapriededer                            NaN        C  NaN
       Zakarian, Mr. Ortin                                  NaN        C  NaN
       Zimmerman, Mr. Leo                                   NaN        S  NaN

                                                         body  \
sex    name
female Allen, Miss. Elisabeth Walton                      NaN
male   Allison, Master. Hudson Trevor                     NaN
female Allison, Miss. Helen Loraine                       NaN
male   Allison, Mr. Hudson Joshua Creighton             135.0
female Allison, Mrs. Hudson J C (Bessie Waldo Daniels)    NaN
...                                                       ...
       Zabour, Miss. Hileni                             328.0
       Zabour, Miss. Thamine                              NaN
male   Zakarian, Mr. Mapriededer                        304.0
       Zakarian, Mr. Ortin                                NaN
       Zimmerman, Mr. Leo                                 NaN

                                                                              home.dest
sex    name
female Allen, Miss. Elisabeth Walton                                       St Louis, MO
male   Allison, Master. Hudson Trevor                   Montreal, PQ / Chesterville, ON
female Allison, Miss. Helen Loraine                     Montreal, PQ / Chesterville, ON
male   Allison, Mr. Hudson Joshua Creighton             Montreal, PQ / Chesterville, ON
female Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  Montreal, PQ / Chesterville, ON
...                                                                                 ...
       Zabour, Miss. Hileni                                                         NaN
       Zabour, Miss. Thamine                                                        NaN
male   Zakarian, Mr. Mapriededer                                                    NaN
       Zakarian, Mr. Ortin                                                          NaN
       Zimmerman, Mr. Leo                                                           NaN

[1309 rows x 12 columns]

In [24]:
titanic_3[['survived']].groupby(level='sex', axis=0).sum()

        survived
sex
female       339
male         161

In [25]:
titanic_3.groupby(level='sex', axis=0)[['survived']].sum()

        survived
sex
female       339
male         161

5. Find the most used type of 'embarked' by the passengers

In [26]:
titanic['embarked'].value_counts()

S    914
C    270
Q    123
Name: embarked, dtype: int64

6. Find the maximum age and the maximum pclass type

In [27]:
titanic['age'].max()

80.0

In [28]:
titanic['pclass'].max()

3

7. Find the top 'cabins' in the titanic ship using describe method on the column 'cabin'

In [29]:
titanic['cabin'].describe()

count             295
unique            186
top       C23 C25 C27
freq                6
Name: cabin, dtype: object